#include <stdio.h>

int main() {
    float score = 90.5;     
    printf("score = %.1f\n", score);   
    return 0;
}

#include <stdio.h>

int main() {
    int score = 90.5;      
    printf("score = %d\n", score);
    return 0;
}
// ผลลัพธ์ที่ได้ต่างกัน กรณี ใช้ float จะเป็นประเภทข้อมูลที่รองรับเลขทศนิยม  และ กรณี ใช้ int จะเป็นประเภทข้อมูลจำนวนเต็ม
// ถ้าหากเลือกใช้ผิดหลักการทำงาน อินพุตออกมาก็จะไม่เป็นไปตามเงื่อนไข และจะเกิด error ได้
// เข้าใจความสำคัญของการจับคู่ชนิดข้อมูลกับค่าที่เก็บ